package com.aixohub.sixyao.yi.utils;

public class YaoUtil {

    /**
     * 三爻转八卦index
     *
     * @param y0
     * @param y1
     * @param y2
     * @return
     */
    public static Integer sanYaoToBaGuaIndex(Integer y0, Integer y1, Integer y2) {
        Integer ix = y0 * 1 + y1 * 2 + y2 * 4;
        return ix;
    }

    public static int[] awxCount(int[] bgDZWX) {
        int[] awxCount = new int[5];
        for (int k = 0; k < 5; k++)//初始化为0
        {
            awxCount[k] = 0;
        }
        //本卦六个爻，看看五行是否上卦
        for (int i = 0; i < 6; i++) {
            awxCount[bgDZWX[i]]++;
        }//计数为0的五行序号是没上卦的

        return awxCount;
    }


    public static Integer liuYaoArrayToGuaIndex(int[] arrYao) {
        Integer ix = arrYao[0] * 1
                + arrYao[1] * 2
                + arrYao[2] * 4
                + arrYao[3] * 8
                + arrYao[4] * 16
                + arrYao[5] * 32;
        return ix;
    }

    //五行列表
    public static String[] WuXing = {
            "木",  //0
            "火",  //1
            "土",  //2
            "金",  //3
            "水"   //4
    };
    //五行方位
    public static String[] WXFangWei = {
            "东",
            "南",
            "中央",
            "西",
            "北"
    };

    public static String[] shiYingPuStrs = {
            "&emsp;",
            "世",
            "应"
    };

    //十天干
    public static String[] TianGan = {"甲", "乙", "丙", "丁", "戊", "己", "庚", "辛", "壬", "癸"};
    //十二地支
    public static String[] DiZhi = {
            "子",
            "丑",
            "寅",
            "卯",
            "辰",
            "巳",
            "午",
            "未",
            "申",
            "酉",
            "戌",
            "亥"
    };

    //八卦纳甲装天干，从下面往上装天干
    //甲0  乙1  丙2  丁3  戊4
    //己5  庚6  辛7  壬8  癸9
    public static int[][] NaJiaTianGan = {
            {1, 1, 1, 9, 9, 9}, //坤000 内乙，外癸
            {6, 6, 6, 6, 6, 6}, //震001 庚
            {4, 4, 4, 4, 4, 4}, //坎010 戊
            {3, 3, 3, 3, 3, 3}, //兑011 丁
            {2, 2, 2, 2, 2, 2}, //艮100 丙
            {5, 5, 5, 5, 5, 5}, //离101 己
            {7, 7, 7, 7, 7, 7}, //巽110 辛
            {0, 0, 0, 8, 8, 8}  //乾111 内甲，外壬
    };

    /**
     * <pre>
     * //八卦纳甲装地支，从下面往上装地支
     * //子0  丑1  寅2  卯3  辰4  巳5
     * //午6  未7  申8  酉9  戌10  亥11
     * </pre>
     */
    public static int[][] naJiaDiZhi = {
            {7, 5, 3, 1, 11, 9}, //坤000
            {0, 2, 4, 6, 8, 10}, //震001
            {2, 4, 6, 8, 10, 0}, //坎010
            {5, 3, 1, 11, 9, 7}, //兑011
            {4, 6, 8, 10, 0, 2}, //艮100
            {3, 1, 11, 9, 7, 5}, //离101
            {1, 11, 9, 7, 5, 3}, //巽110
            {0, 2, 4, 6, 8, 10}  //乾111
    };

    //地支速查五行
//五行排序 木0 火1 土2 金3 水4
    public static int[] diZhiChaWuXing = {
            4,//子水
            2,//丑土
            0,//寅木
            0,//卯木
            2,//辰土
            1,//巳火
            1,//午火
            2,//未土
            3,//申金
            3,//酉金
            2,//戌土
            4 //亥水
    };

    //六亲数组，本卦五行为我，六亲其实只有五行，按照 %5 运算
    public static String[] LiuQinArray = {
            "兄弟",//+0，同我
            "子孙",//+1，我生
            "妻财",//+2，我克
            "官鬼",//+3，克我
            "父母" //+4，生我
    };

    //六神数组，按照 %6 运算
    public static String[] LiuShenArray = {
            "青龙",//0
            "朱雀",//1
            "勾陈",//2
            "腾蛇",//3
            "白虎",//4
            "玄武" //5
    };
    //日干起六神
    public static int[] RiGanQiLiuShen = {
            0, 0, //甲乙起青龙
            1, 1, //丙丁起朱雀
            2,   //戊起勾陈
            3,   //己起腾蛇
            4, 4, //庚辛起白虎
            5, 5  //壬癸起玄武
    };

    //八卦排法，从上到下，高位到低位
    public static String[] BaGua = {
            "坤", //000
            "震", //001 阳
            "坎", //010 阳
            "兑", //011
            "艮", //100 阳
            "离", //101
            "巽", //110
            "乾"  //111 阳
    };
    //八卦序号查数字
    public static int[] BaGuaChaShuZi = {
            8,//坤八
            4,//震四 阳
            6,//坎六 阳
            2,//兑二
            7,//艮七 阳
            3,//离三
            5,//巽五
            1 //乾一 阳
    };

    //数字查八卦序号
    public static int[] ShuZiChaBaGua = {
            0, //0就是8，坤卦
            7, //1是乾，111
            3, //2是兑，011
            5, //3是离，101
            1, //4是震，001
            6, //5是巽，110
            2, //6是坎，010
            4, //7是艮，100
            0  //8是坤，000
    };

    //五行排序 木0 火1 土2 金3 水4
    //卦宫查五行
    public static int[] BaGuaWuXing = {
            2,//坤为地，土
            0,//震为雷，木
            4,//坎为水，水
            3,//兑为泽，金
            2,//艮为山，土
            1,//离为火，火
            0,//巽为风，木
            3 //乾为天，金
    };

    //宫内八个卦的称呼
    public static String[] GongNeiBaGuaMingChen = {
            "纯卦", "初世", "二世", "三世", "四世", "五世", "游魂", "归魂"
    };
    //安世爻位置，序号从0到5
    public static int[] AnShiYao = {
            5, //纯卦六世
            0, //一世
            1, //二世
            2, //三世

            3, //四世
            4, //五世
            3, //游魂 四世
            2  //归魂 三世
    };

    //宫序号
    //  "坤", 0
    //  "震", 1
    //  "坎", 2
    //  "兑", 3
    //  "艮", 4
    //  "离", 5
    //  "巽", 6
    //  "乾"  7
    //第0列卦名，第1列卦宫序号，第2列宫内八个卦的序号
    //第3列应爻世爻关系：生克、冲合、比
    public static String[][] Array64Gua = {
            //上坤八卦
            //000 000
            {"坤为地", "0", "0", "六冲克"},
            //000 001
            {"地雷复", "0", "1", "六合克"},
            //000 010
            {"地水师", "2", "7", "世克应"},
            //000 011
            {"地泽临", "0", "2", "应生世"},
            //000 100
            {"地山谦", "3", "5", "世克应"},
            //000 101
            {"地火明夷", "2", "6", "应克世"},
            //000 110
            {"地风升", "1", "4", "世应比"},
            //000 111
            {"地天泰", "0", "3", "六合生"},
            ///////////////////////////
            //上震八卦
            //001 000
            {"雷地豫", "1", "1", "六合生"},
            //001 001
            {"震为雷", "1", "0", "六冲比"},
            //001 010
            {"雷水解", "1", "2", "世生应"},
            //001 011
            {"雷泽归妹", "3", "7", "世应比"},
            //001 100
            {"雷山小过", "3", "6", "世生应"},
            //001 101
            {"雷火丰", "2", "5", "应生世"},
            //001 110
            {"雷风恒", "1", "3", "应生世"},
            //001 111
            {"雷天大壮", "0", "4", "六冲克"},
            //////////////////////////////
            //上坎八卦
            //010 000
            {"水地比", "0", "7", "应生世"},
            //010 001
            {"水雷屯", "2", "2", "世克应"},
            //010 010
            {"坎为水", "2", "0", "六冲克"},
            //010 011
            {"水泽节", "2", "1", "六合克"},
            //010 100
            {"水山蹇", "3", "4", "应生世"},
            //010 101
            {"水火既济", "2", "3", "世应比"},
            //010 110
            {"水风井", "1", "5", "世克应"},
            //010 111
            {"水天需", "0", "6", "世生应"},
            //////////////////////////////
            //上兑八卦
            //011 000
            {"泽地萃", "3", "2", "世克应"},
            //011 001
            {"泽雷随", "1", "7", "世应比"},
            //011 010
            {"泽水困", "3", "1", "六合生"},
            //011 011
            {"兑为泽", "3", "0", "六冲比"},
            //011 100
            {"泽山咸", "3", "3", "应生世"},
            //011 101
            {"泽火革", "2", "4", "世生应"},
            //011 110
            {"泽风大过", "1", "6", "应克世"},
            //011 111
            {"泽天夬", "0", "5", "世克应"},
            //////////////////////////////
            //上艮八卦
            //100 000
            {"山地剥", "7", "5", "世克应"},
            //100 001
            {"山雷颐", "6", "6", "世克应"},
            //100 010
            {"山水蒙", "5", "4", "应克世"},
            //100 011
            {"山泽损", "4", "3", "应克世"},
            //100 100
            {"艮为山", "4", "0", "六冲克"},
            //100 101
            {"山火贲", "4", "1", "六合克"},
            //100 110
            {"山风蛊", "6", "7", "世克应"},
            //100 111
            {"山天大畜", "4", "2", "应生世"},
            ////////////////////////////////
            //上离八卦
            //101 000
            {"火地晋", "7", "6", "应生世"},
            //101 001
            {"火雷噬嗑", "6", "5", "应克世"},
            //101 010
            {"火水未济", "5", "3", "世应比"},
            //101 011
            {"火泽睽", "4", "4", "应克世"},
            //101 100
            {"火山旅", "5", "1", "六合生"},
            //101 101
            {"离为火", "5", "0", "六冲克"},
            //101 110
            {"火风鼎", "5", "2", "应克世"},
            //101 111
            {"火天大有", "7", "7", "应生世"},
            ////////////////////////////////
            //上巽八卦
            //110 000
            {"风地观", "7", "4", "世应比"},
            //110 001
            {"风雷益", "6", "3", "应克世"},
            //110 010
            {"风水涣", "5", "5", "世生应"},
            //110 011
            {"风泽中孚", "4", "6", "应生世"},
            //110 100
            {"风山渐", "4", "7", "世克应"},
            //110 101
            {"风火家人", "6", "2", "应生世"},
            //110 110
            {"巽为风", "6", "0", "六冲克"},
            //110 111
            {"风天小畜", "6", "1", "应克世"},
            ////////////////////////////////
            //上乾八卦
            //111 000
            {"天地否", "7", "3", "六合克"},
            //111 001
            {"天雷无妄", "6", "4", "六冲克"},
            //111 010
            {"天水讼", "5", "6", "应生世"},
            //111 011
            {"天泽履", "4", "5", "世克应"},
            //111 100
            {"天山遁", "7", "2", "世克应"},
            //111 101
            {"天火同人", "5", "7", "应克世"},
            //111 110
            {"天风姤", "7", "1", "应生世"},
            //111 111
            {"乾为天", "7", "0", "六冲比"}
    };


    //60甲子
    public static String[] JiaZi = {
            "甲子",
            "乙丑",
            "丙寅",
            "丁卯",
            "戊辰",
            "己巳",
            "庚午",
            "辛未",
            "壬申",
            "癸酉",
            "甲戌",
            "乙亥",
            "丙子",
            "丁丑",
            "戊寅",
            "己卯",
            "庚辰",
            "辛巳",
            "壬午",
            "癸未",
            "甲申",
            "乙酉",
            "丙戌",
            "丁亥",
            "戊子",
            "己丑",
            "庚寅",
            "辛卯",
            "壬辰",
            "癸巳",
            "甲午",
            "乙未",
            "丙申",
            "丁酉",
            "戊戌",
            "己亥",
            "庚子",
            "辛丑",
            "壬寅",
            "癸卯",
            "甲辰",
            "乙巳",
            "丙午",
            "丁未",
            "戊申",
            "己酉",
            "庚戌",
            "辛亥",
            "壬子",
            "癸丑",
            "甲寅",
            "乙卯",
            "丙辰",
            "丁巳",
            "戊午",
            "己未",
            "庚申",
            "辛酉",
            "壬戌",
            "癸亥"
    };
}
